{
    "last_updated": 1673755492,
    "tweets": [
        {
            "created_at": 1672160233,
            "text": "The drag on home furnishings and furniture sales from a 10%+ shift in home buying to renting is significant. If 500K single family homes move in the rental pool, that will depress home furnishings purchases by $7-$8B or 2-3% (those are big numbers for that industry) https://t.co/g8MG0Qnohg",
            "rating": -0.5106,
            "company_keywords": [
                "shift"
            ]
        },
        {
            "created_at": 1671036990,
            "text": "In 2023, people are going to go back and wish they saw this tweet. $OSTK's @tZERO platform appears to be on the cusp of some MAJOR developments and is the ONLY regulated platform in the US to trade crypto and security tokens. The backing of the NYSE and $ICE is an added bonus https://t.co/NSGx4UXyBl",
            "rating": 0.8271,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1670616370,
            "text": "Just an observation, there's a lot of chatter about the large outperformance gap between the $XLE and crude YTD.  However here's how the performance looks on a 5-year basis:\n\nCrude = +24.8%\nXLE = +21.1%\n\nEnergy stocks caught up to the underlying commodity the past 12-24 mos",
            "rating": -0.743,
            "company_keywords": [
                "gap"
            ]
        },
        {
            "created_at": 1670534631,
            "text": "I thought the 1.4% incremental margins delivered by $COST in the quarter would be a major problem for investors. \n\nThen @jeffmacke shouted \"this isn't an industrial company, stop making up issues, let me go back to watching Rocky IV\" (underrated holiday film).\n\nNo position",
            "rating": -0.5267,
            "company_keywords": [
                "delivered"
            ]
        },
        {
            "created_at": 1669044382,
            "text": "I rewatched the CNBC segment with $SI's CEO. Listen to the words he uses. 2 things standout: 1) He lacks domain expertise on credit (listen to what he says about LTVs), and 2) He does not appear overly knowledgeable about the crypto ecosystem. That's a dangerous mix in my mind",
            "rating": -0.128,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1668695807,
            "text": "The prevailing view in the investment community is that the US is hugely undersupplied in housing. For some reason I never see anyone include multi-family units in their calculus. Single family home construction has rolled over sharply, yet housing starts are at a record high https://t.co/8seeNN7iti",
            "rating": 0.0,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1668357540,
            "text": "Two questions for the $SI bulls: 1) when in the history of capital mkts has good news been published on a Friday after the close? The timing of the PR was highly conspicuous. 2) $CRO (https://t.co/c6FOjnlKit)is down (-25%) today, will this be the next major $SI client to fall?",
            "rating": 0.504,
            "company_keywords": [
                "news",
                "two"
            ]
        },
        {
            "created_at": 1667936009,
            "text": "If you're long energy stocks, you don't want a Red wave today.\n\nI doubt the boys in the oil patch think in these terms, at the ballot box but Dems have been fantastic for crude and NG prices.",
            "rating": -0.1182,
            "company_keywords": [
                "box"
            ]
        },
        {
            "created_at": 1667927413,
            "text": "The 2008 analogs are running through the minds of anyone who lived that cycle.  Binance = $JPM (this time with the Chinese gov't backing), FTX = $BSC, bought for $2/share and $COIN is some combo of Merrill/Lehman. \n\nIs that why risk assets caught a bid as the FTX news came out?",
            "rating": -0.1027,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1667926876,
            "text": "Still trying to figure out what the FTX funding model was.  That's going to be some saga. \n\nHowever, this tweet really sticks with me: FTX was committed to a \"more decentralized global economy\"... by consolidating all of the busted exchanges. Now Binance is \"centralizing\" FTX... https://t.co/aa4ATuYnZD",
            "rating": 0.2732,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1667539882,
            "text": "PAA Research Report: TRUP: A Broken Covenant and Now a Test of Faith https://t.co/6KkqKCcBAC",
            "rating": -0.0772,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1665517549,
            "text": "$OSTK Medici Ventures portfolio company Settlemint completes Series A round. \n\nKey words here: \"upround\".  \n\nHow many venture companies will be able to say that this quarter?\n\nPlenty of value in the Medici portfolio. Now if investors would actually look.... https://t.co/3XHOvszpeD",
            "rating": 0.34,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1665406128,
            "text": "PAA Research Report: TRUP: The Four Biggest Problems Facing TRUP Right Now https://t.co/ipRAqqAsBE",
            "rating": -0.4019,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1663296310,
            "text": "$NCR ends its sales process, for what seems like the fifth time over the past 15-20 yrs.  Now they're going to split into two companies as various HFs speed dial their primes to get a borrow on the spin of the ATM biz.\n\nNot to worry, bankers said there were numerous bids for $NCR",
            "rating": 0.6002,
            "company_keywords": [
                "ncr",
                "now",
                "two"
            ]
        },
        {
            "created_at": 1662486518,
            "text": "Mkts are appropriately focused on the impact of the Nord Stream shutdown on Europe, but what about the implications for Russia? Two legitimate questions: 1) How do they make up for those lost revs from NG sales to Europe, and 2) In 6-9 months time, what's their strategy then?",
            "rating": -0.3632,
            "company_keywords": [
                "two"
            ]
        }
    ]
}