{
    "last_updated": 1673755495,
    "tweets": [
        {
            "created_at": 1673727844,
            "text": "$SI Banking offshore exchange of their largest shareholder @BrendanBlumer who renounced his US citizenship amidst allegations of orchestrating \"biggest of all crypto frauds\".  Pay to play? @Alan_JPCatholic https://t.co/1Qyule9JGG",
            "rating": 0.25,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1673397303,
            "text": "RT @OtherSide_AM: So ... in other words ... A BAIL OUT\n\nutilizing the FHLB to support crypto fraud\n\n@AlderLaneEggs @KeithMcCullough @Hedgeye",
            "rating": -0.2732,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1673383073,
            "text": "$SI Interesting from @kateberry1 about implications of Silvergate tapping the Federal Home Loan Bank for $4.3B. FHLB designed to support housing but now propping up crypto bank frequented by criminals. \"The $4.3 billion is clearly at risk and leaves the FDIC holding the bag\". https://t.co/9daCzUVijd https://t.co/H6VMAgD12M",
            "rating": -0.3506,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1673282452,
            "text": "$MCB Now exiting crypto citing \"material changes in the regulatory environment regarding banks’ involvement in crypto-asset related businesses\".  Yet $SI plans to continue banking these foreign exchanges where criminals gather to launder Billions? \n\nhttps://t.co/QvBMptNZO5",
            "rating": -0.5719,
            "company_keywords": [
                "crypto",
                "now"
            ]
        },
        {
            "created_at": 1673273047,
            "text": "RT @JCOviedo6: Wedbush downgrades $SI cuts price target to $9/share. \n\nEstimates Tangible Book Value per share is as low as $9/share. https…",
            "rating": 0.0772,
            "company_keywords": [
                "target"
            ]
        },
        {
            "created_at": 1673061777,
            "text": "$SI SDNY now investigating “money flows” between Barry Silbert’s DCG companies. They have close ties with Alan Lane as the bank’s very first crypto customer. Silbert later invested in @silvergatebank and his website still claims $SI as a “portfolio company”. https://t.co/aeb3Zq8ycX",
            "rating": 0.0,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1672965944,
            "text": "$SI Now Huobi Goes. This is the @silvergatebank customer we just profiled as opening accounts for bearded Taylor Swift impersonator and used by foreign criminals such as North Korea's Lazarus to launder Billions.  Where were the signs? @TylerPearson \nhttps://t.co/4CsrFGJllX https://t.co/NXqKcii0Bo https://t.co/DsF8Ty0V6d",
            "rating": -0.4404,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1672334196,
            "text": "9/ Silvergate tells investors its customer diligence includes site visits, \"reputation review\", \"negative news\", reviews of audits, and \"culture of compliance\".  Yet problems @HuobiGlobal are open and obvious. We struggle to understand how $SI could have possibly done this work. https://t.co/EhOwQB5Ndv",
            "rating": -0.8271,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1672334195,
            "text": "8/ Sun is described as a \"connoisseur of bank accounts\" by @verge because \"banks froze his money so frequently he needed to spread his fortune across numerous accounts\". Before $SI, Sun says crypto bankers would “get arrested or even charged for money laundering”. https://t.co/b5sVtQQo3p",
            "rating": -0.5994,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1672334191,
            "text": "2/ Huobi KYC so lax that crypto investigator @cipher_blade was able to open @HuobiGlobal accounts posing as a bearded Taylor Swift and Borat.  $SI @silvergatebank @MichelleSabins \nhttps://t.co/0aNgOPcsc3 https://t.co/p4MUcqLWId",
            "rating": 0.2023,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1671648844,
            "text": "Documents reveal $SI even opened 12 bank accounts for the \"Scammer Crypto Kid\" who orchestrated $90M Ponzi Scheme.  20 year old Australian who was stealing money to pay \"Sugar Babies\" yet CEO Lane publicly claims \"We only bank institutions who are also serious about regulation\". https://t.co/Eybn3WSIvA",
            "rating": -0.6597,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1671151870,
            "text": "At what point do legitimate banks start blocking or filing SARs for all wires from @silvergatebank ? Indicted money launderers and fraudsters. foreign gangs , Mexican &amp; Colombian crypto outfits, Bukele, Tether co-defendants and more we will soon expose   @fdic @AlderLaneEggs  $SI https://t.co/Snu9n9hxo6",
            "rating": -0.765,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1670871606,
            "text": "4/ Bitso has said it and $SI work with El Salvador government to facilitate payments for Bukele's crypto project. Yet @USTreasury has specifically described dealings between Bukele regime and violent MS-13 gangs.  AML risks here widely reported. https://t.co/yuCPQFMPxm",
            "rating": 0.0343,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1670871604,
            "text": "2/ Bitso's website currently touts that crypto users can move money anywhere in the world \"as easy as ordering a pizza\" and with \"total protection\" because @silvergatebank is FDIC insured. \n\nhttps://t.co/yLwGN36vZo https://t.co/SiSqNyI2Gh",
            "rating": 0.4215,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1670871603,
            "text": "1/  @Reuters investigation into Cartels using crypto profiled a notorious sex trafficker caught laundering money using Bitso, a Mexican &amp; Colombian crypto operator. \nWe learned @silvergatebank is banking Bitso in undisclosed foray and are short $SI. \nhttps://t.co/mViOJ7eUHa https://t.co/ZLbsbAzM1F",
            "rating": -0.4404,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1670635166,
            "text": "$SI Former employees now talking to the press about Alan Lane.\n\n“This was a tiny real estate lender that went all-in on crypto,” said one former employee. “It was completely weird. https://t.co/uyit9pCcnH",
            "rating": -0.2484,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1670603242,
            "text": "$SI Now appears to have DELETED the testimonial featuring @BittrexExchange from their website following yesterdays' revelations regarding OFAC violations, \"Donald Duck\" accounts, and fraud/Tether allegations.  Does @silvergatebank have any idea who they are doing business with? https://t.co/wAnoRK2l7F",
            "rating": -0.5267,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1670525337,
            "text": "8/ We note that the lawsuit also references recordings in which the Tether parties discuss banking troubles and forming \"don't ask don't tell\" relationships with banks.  The concern is that exchanges with US bank accounts are serving as \"backdoors\" for offshore crypto actors. https://t.co/HwHrU4PtOb",
            "rating": -0.296,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1670525336,
            "text": "6/ $SI Bittrex is also named as a co-defendent in a civil class action lawsuit alongside Tether, Bitfinex, and Reggie Fowler alleging that it conspired with these crypto actors as part of money laundering / manipulation scheme involving Billions. \nhttps://t.co/0ICNXeDwLs https://t.co/6KphGax77f",
            "rating": -0.4767,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1670525332,
            "text": "3/ @NYDFS concluded that @BittrexExchange \"has failed to demonstrate responsibility, financial and business experience, or the character and fitness to warrant the belief that its business will be conducted honestly\".  But apparently $SI has taken a quite different view. https://t.co/8Kr0ktCE9d",
            "rating": -0.1531,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1670525329,
            "text": "1/ $SI Website now features customer testimonial from @BittrexExchange. Baffling choice considering Treasury recently announced action against Bittrex for AML/BSA violations including $263 million in crypto transactions involving Iran, Cuba, Syria and other sanctioned locales. https://t.co/HRc2rfBF19",
            "rating": -0.3818,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1670369385,
            "text": "RT @Bitfinexed: We are aware of two instances where Bitfinex opened accounts in the names of their customers at Silvergate. Both customers…",
            "rating": 0.0,
            "company_keywords": [
                "two"
            ]
        }
    ]
}