{
    "last_updated": 1673755496,
    "tweets": [
        {
            "created_at": 1670623096,
            "text": "I'm glad it's over. Absolute chaos. I'm still not sure why but somehow the ref gave me a yellow card too. I love football.",
            "rating": 0.7157,
            "company_keywords": [
                "yellow"
            ]
        },
        {
            "created_at": 1669321973,
            "text": "Now that's a goal.. Damn #BRA",
            "rating": -0.4019,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1667602299,
            "text": "Lolll.. I love that Musk paid $44 billion and is busy patrolling this website banning anybody who hurt his feelings.. In the name of freedom of speech of course. I'm afraid we now live inside the clown car and it's built by Tesla. https://t.co/7SL5EdzI3X",
            "rating": 0.7184,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1664470566,
            "text": "When launched off a mountain cliff the Tesla Model 3 can also serve as a flying device... You know... \"Briefly\" https://t.co/utcWdfQISk",
            "rating": 0.128,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1664029400,
            "text": "Lol.. So in their feelings. 2008 froze financial institutions as the bubble was sitting on their balance sheets. That's totally like crypto, which btw is down like 70%. And as we can all tell Walmart n 'em are worrying about making payroll as money market funds have seized up. https://t.co/3y3g0GpPjx",
            "rating": 0.4915,
            "company_keywords": [
                "crypto",
                "walmart"
            ]
        },
        {
            "created_at": 1663616180,
            "text": "The character gap between the AZ GOP of McCain or Jeff Flake and the current Q-Anon/MAGA crop is the size of the Grand Canyon.",
            "rating": 0.4588,
            "company_keywords": [
                "gap"
            ]
        },
        {
            "created_at": 1662672034,
            "text": "RT @mroctober: Now we all know I was innocent ! Amen! RIP Queen E !",
            "rating": 0.5067,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1655154281,
            "text": "RT @forwardcap: Now that the first electric vehicle SPAC is filing for bankruptcy, it’s a good time to reflect on the insanity and outright…",
            "rating": -0.2023,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1637127403,
            "text": "Terrible news for the crypto heads and they don't even know it. The sports arena branding curse is stronger than the curse of the Bambino. https://t.co/0mtDDBNxLu",
            "rating": -0.8176,
            "company_keywords": [
                "news",
                "crypto"
            ]
        },
        {
            "created_at": 1626040731,
            "text": "They don't seem to be actively trying to burn Wembley down (so far...). Which is a nice surprise.",
            "rating": 0.7351,
            "company_keywords": [
                "nice"
            ]
        }
    ]
}