{
    "last_updated": 1673755489,
    "tweets": [
        {
            "created_at": 1670423533,
            "text": "What CFO can be so negligent and aggressive?\n\nANSWER.  Before IPO $AGL appointed Tim Bensley as CFO despite him not having any experience in healthcare. He did have one unique skill needed, no problem fooling Wall St!",
            "rating": -0.8297,
            "company_keywords": [
                "tim"
            ]
        },
        {
            "created_at": 1667474122,
            "text": "$PTON ...3 years and a pandemic later, but finally, this POS will find its way to our initial target.  Watching this play out has been a true lesson in groupthink, confirmation bias, and irresponsible analysts.  https://t.co/I5WHlWw5pP",
            "rating": 0.4357,
            "company_keywords": [
                "target"
            ]
        },
        {
            "created_at": 1663173999,
            "text": "In case you missed yesterday amidst the carnage $GOOG for $PINS. @karaswisher and @profgalloway both agree this takeout talk is real and NOW. Just listen for yourself start at 59 minute mark. Citron believes number is north of $38\nhttps://t.co/MieQrHlZqX",
            "rating": 0.1531,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1663079359,
            "text": "“We believe Pinterest can build a strong ad platform as it grows its user base and improves monetization,” he says.",
            "rating": 0.7269,
            "company_keywords": [
                "pinterest"
            ]
        },
        {
            "created_at": 1663079359,
            "text": "“Its ad sales remain less dependent on Apple’s data regarding user behavior outside of the Pinterest app,” says Ali Mogharabi, who covers Pinterest and Twitter for Morningstar.\n\nJ.P Morgan’s Anmuth says Apple’s policy change has had little impact on Pinterest.",
            "rating": 0.0,
            "company_keywords": [
                "apple",
                "morningstar",
                "pinterest"
            ]
        },
        {
            "created_at": 1663079359,
            "text": "TikTok, while wonderfully addictive, promotes doomscrolling and is owned by Bytedance which will always face some backlash in the US.\n\nGoogle will like Pinterest’s lack of vulnerability to changes in IOS.",
            "rating": 0.6808,
            "company_keywords": [
                "pinterest"
            ]
        },
        {
            "created_at": 1663078205,
            "text": "While having Pichai on the hotseat, he was asked questions about his opinion of the tech landscape and including his opinion on the potential twitter acquisition. While calmly saying he did not want to participate in that discussion someone randomly asked\n\n“What about Pinterest?”",
            "rating": 0.2681,
            "company_keywords": [
                "pinterest"
            ]
        },
        {
            "created_at": 1663078205,
            "text": "$PINS + $GOOG  Dont look now but look who has the hottest property on social media. Shuffles by Pinterest. This morning was reffered to as  “Gen Z new Favorite App”https://t.co/9CIMLWVH7x. Motley Fool asked \"Did Pinterest find its own Instagram?",
            "rating": 0.0387,
            "company_keywords": [
                "pinterest"
            ]
        },
        {
            "created_at": 1657568279,
            "text": "To be clear, there is A LOT of Fraud in the world of Crypto and I believe that ETH or smart contracts have no place in the complex world we live in.  BTC, has the collective conciseness of perceived value but also no utility.  Hype and Fraud different things",
            "rating": -0.8248,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1656514340,
            "text": "Looking forward to joining the esteemed panelists at Berkeley Law Fraud Fest. Will focus on the fraudulent crypto ecosystem.  Ethereum smart contracts?  WTF? Still 140 bil of mkt cap. ETHE will go right back to $300 https://t.co/uVjCiyQxBl",
            "rating": -0.807,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1652319070,
            "text": "With cryto implosion can the Lakers fix this or are they stuck for 20 years with https://t.co/NOZDTp5ytl arena?  At least the Clippers got Intuit. https://t.co/hozD5FuFB0.",
            "rating": -0.25,
            "company_keywords": [
                "intuit"
            ]
        },
        {
            "created_at": 1650477295,
            "text": "$JMIA.   yes...$BABA owns controlling stake in  4PX Express.  We know today is not the market for stocks like $JMIA but last mile for China in Africa will be the eventual catalyst for the stock to trade much higher.",
            "rating": 0.1901,
            "company_keywords": [
                "express"
            ]
        },
        {
            "created_at": 1642690547,
            "text": "One year since $GME....whew.   Now let's find a new company that is a disruptor and the disrupted. A co that is making the world a better place.  Maybe some insider buying would be cool also.",
            "rating": 0.6369,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1638197958,
            "text": "$REAL.  The luxury resale market getting more attention every day.  If EBAY does not acquire REAL then it almost seems like a no brainer for Saks and their e-commerce ambitions...or it continues to grow at 35%.  Maintain $30 tgt\nhttps://t.co/Tx19Xkn21m\nhttps://t.co/M3DnWT5Fkf",
            "rating": 0.0735,
            "company_keywords": [
                "ebay"
            ]
        },
        {
            "created_at": 1637764351,
            "text": "$REAL will be $30 next 12 months if not acquired by Ebay first.  Credit Card data for the month is on fire, no supply chains issues, on the right side of ESG and fashion.  Luxury resale market globally is becoming a megatrend and $REAL is the clear leader\nhttps://t.co/NXe3vl95G3",
            "rating": 0.1531,
            "company_keywords": [
                "ebay"
            ]
        },
        {
            "created_at": 1636128348,
            "text": "$BBBY is on sale and the board knows it.  Same setup as Citron favorite $RH was 3 years ago.  While we are not suggestion this is the next $RH....the buyback has many similarities.   For more detail.  https://t.co/Fn9MwK5FlX.  .",
            "rating": 0.4588,
            "company_keywords": [
                "rh"
            ]
        },
        {
            "created_at": 1635255498,
            "text": "Wall St. excited about Stripe &amp; Klarna deal and who powers Klarna?  $MQ   Between Klarna, Affirm, $COIN and $MA.  Marqeta has become the API behind Crypto and BNPL.  Price tgt of $55 might be sooner than expected",
            "rating": 0.34,
            "company_keywords": [
                "crypto",
                "affirm"
            ]
        },
        {
            "created_at": 1635169873,
            "text": "$MQ the next gen payment platform powering all major crypto platforms including today’s announced $BKKT crypto partnership with $MA Citron has much more to say. $MQ tgt.  55",
            "rating": 0.0,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1634644374,
            "text": "To see such an impressive list of innovators turn to Marqeta to build out new crypto cards and reward programs shows the flexibility of our modern card issuing platform and our unique modern architecture, which can support entirely new card constructs... https://t.co/qdOVpqxC8h",
            "rating": 0.9022,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1631715398,
            "text": "$REAL $30 target  Luxury resale has attracted more new buyers since 2019 than all previous years combined.   https://t.co/Fn9MwK5FlX.  .",
            "rating": 0.4215,
            "company_keywords": [
                "target"
            ]
        }
    ]
}