{
    "last_updated": 1673755493,
    "tweets": [
        {
            "created_at": 1673453627,
            "text": "✔️ Control costs; reduce losses on streaming.\n\n✔️ Shift distribution decisions back to creative execs.\n\n✔️ Employees back to office.\n\n✔️ Olive branch to park regulars. \n\nIger understands (and feels) the emotions connected to $DIS + other branded IP. Bet he extends beyond 2yrs. https://t.co/ymy809ubtd",
            "rating": 0.1779,
            "company_keywords": [
                "shift"
            ]
        },
        {
            "created_at": 1672950720,
            "text": "At its Nov 2008 low, $DPZ was a penny stock. Its entire market cap was about two weeks of today's sales. Even allowing for market recovery a year later, from 2010, pizza has been a better investment than anything in tech. I'm cherry-picking to make a point: it needn't be complex.",
            "rating": 0.2023,
            "company_keywords": [
                "nov",
                "two"
            ]
        },
        {
            "created_at": 1672852939,
            "text": "Buffett's view on private equity shops: https://t.co/RQsu2T3oC1",
            "rating": 0.0,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1671827963,
            "text": "House Ways &amp; Means: the gap between taxes owed but uncollected is $7 TRILLION over a decade. That’s a number.",
            "rating": 0.1154,
            "company_keywords": [
                "gap"
            ]
        },
        {
            "created_at": 1671750030,
            "text": "A member of the congregation just asked Elon if we might connect our Twitter profiles to our Tesla’s… we could listen to Spaces while at a charging station. Musk likes it. New questioner has a suggestion for pumping the stock again. Now Elon being asked if he hates trans people.",
            "rating": -0.0258,
            "company_keywords": [
                "tesla",
                "now"
            ]
        },
        {
            "created_at": 1671748057,
            "text": "Elon claiming on a Spaces that he won’t be selling anymore $TSLA shares for two years.",
            "rating": 0.296,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1671588410,
            "text": "Let me help everyone out... this isn't such big news. You can give someone the title of CEO, you can call them Emperor of Twitter for all I care. Whoever runs Twitter day to day will serve at the pleasure of one person. https://t.co/xbigymSRM6",
            "rating": 0.8625,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1671558283,
            "text": "WSJ: From YE'19 over roughly two years covering the pandemic, $AMZN doubled its employee count from 798K to 1.6M +100%\n\n$META: 44.9K to 87K employees. +94%\n\n$CRM: 49K to 74K employees. +51%\n\nS&amp;P500: 26.4M to 28.5M +8%",
            "rating": 0.0,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1671214147,
            "text": "The irony of today's moral panic over free speech is that there has never been a time when more people express themselves in more ways. Speech is thriving. The confusion is around an entitlement to be heard. From my house to your media platform, no one is obliged to you host you.",
            "rating": -0.5574,
            "company_keywords": [
                "express"
            ]
        },
        {
            "created_at": 1671053947,
            "text": "Paraphrasing @tracyalloway from Odd Lots... she credits the observation to someone else, but in short, the crypto complex is basically 20 dudes w/ an army of shell companies.\n\nMight have the exact quote wrong, but I've always suspected that this was the gist of the shitcoin game.",
            "rating": -0.7506,
            "company_keywords": [
                "shell",
                "crypto"
            ]
        },
        {
            "created_at": 1670891131,
            "text": "Never forget the institutions, VCs, and media personalities who invested in and publicly promoted this magic bean, yield farming, black box token-birthing, crypto-tom-fuckery. \n\nWe've seen this shit before (fraud is a reoccurring natural phenomenon) but this one was really DUMB! https://t.co/A8FaJGdaOW",
            "rating": -0.7859,
            "company_keywords": [
                "box"
            ]
        },
        {
            "created_at": 1670538902,
            "text": "Atlas Rugged™ https://t.co/81jTQsCReX",
            "rating": 0.0,
            "company_keywords": [
                "atlas"
            ]
        },
        {
            "created_at": 1669924601,
            "text": "Elon exploited the psychology of affinity schemes perfectly. He leverages ideological alignment with customers and investors into financial and rhetorical support. Tesla titillated the environmental left; his \"free-speech\" Twitter game energizes the right. It's all wearing thin. https://t.co/6SKpuYuclk",
            "rating": 0.7906,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1668801405,
            "text": "Just scrolling through a watchlist of stocks in the news. They say this is monopoly-like but seems they've never made very much money. Opinions welcome.",
            "rating": 0.6124,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1668716644,
            "text": "If at this point you believe holding \"stablecoins\" at a crypto broker shields you from the breakdown in shitcoin markets, then your faith in human nature has little resemblance to mine.",
            "rating": 0.4215,
            "company_keywords": [
                "crypto"
            ]
        }
    ]
}