{
    "last_updated": 1673755490,
    "tweets": [
        {
            "created_at": 1621439464,
            "text": "Like Let’s Gowex + Luckin Coffee, there have been critics of $YALA since its IPO.\n\nThe two reports about YALA this week seem to provide more specific and detailed examples of how the company makes no sense. \n\nAs was the case for Let’s Gowex + Luckin Coffee.",
            "rating": -0.2263,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1614269695,
            "text": "When we were short $CRTO 4 years ago, nearly 100% of the business was retargeting. Today, retargeting is 80%. The company a few weeks ago announced its commitment to shift further away from retargeting. We have reasons to believe this trend will accelerate in coming years.",
            "rating": 0.3818,
            "company_keywords": [
                "shift"
            ]
        },
        {
            "created_at": 1592496813,
            "text": "Friendly reminder: we have NEVER seen any market regulator in any jurisdiction - other than in Germany - ban short selling of just a single issuer. This extraordinary action last year merits a thorough explanation, especially in light of today’s Wirecard news. https://t.co/5q4cOkylkm",
            "rating": 0.3182,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1573232513,
            "text": "(3) Unwinding of Distributor shenanigans: we flagged some insular distributor networks that appeared to \"arbitrage\" $MED MLM compensation schemes, during the boom times, such that these rings could dump $MED product onto ebay, etc., at severely discounted prices, yet still make $",
            "rating": -0.8192,
            "company_keywords": [
                "ebay"
            ]
        },
        {
            "created_at": 1573231515,
            "text": "(1) We do not trust $MED management's explanation for the credit card fraud issue - management's response to the questions about bad debt versus fake revenue seems suspect.  We think there is more going on. At best, management provided (mostly) truthful, but incomplete answers.",
            "rating": -0.5425,
            "company_keywords": [
                "trust"
            ]
        },
        {
            "created_at": 1573231173,
            "text": "Gotham City Research's updated opinion on $MED:\n\nWe believe $MED shares face additional downside risk, and will reach $30-$58 per share within the next 12-18 months. (In September of last year, we arrived at a price target between $30 and $79 per share for $MED). \n\nHere is why:",
            "rating": 0.3818,
            "company_keywords": [
                "target"
            ]
        },
        {
            "created_at": 1573223997,
            "text": "Gotham City Research initiated coverage of $MED last year with a strong sell opinion. Shares are down -30% today, hitting the upper end of our price target. We will be providing our updated thoughts on $MED shares today. https://t.co/zP5KeLM27T",
            "rating": 0.7717,
            "company_keywords": [
                "target"
            ]
        },
        {
            "created_at": 1572533331,
            "text": "“JP Morgan Downgrades $CRTO to Underweight : PT $16.00”\n\nA stone’s throw from our original price target, set 2 years ago. Well done, JPM! 👍",
            "rating": 0.5707,
            "company_keywords": [
                "target"
            ]
        },
        {
            "created_at": 1550497938,
            "text": "Don’t trust us: BAFIN’s counterpart in the USA, the SEC itself, has expressed regret over past short selling bans. In fact, the head of the SEC in 2008 outright stated it would not impose short selling bans again, as the costs outweighed the benefits:\n\nhttps://t.co/y5K8WGD8pT",
            "rating": 0.6108,
            "company_keywords": [
                "trust"
            ]
        },
        {
            "created_at": 1547990013,
            "text": "RT @business: Apple CEO Tim Cook called on the FTC to track data brokers and monitor how they use people’s digital information https://t.co…",
            "rating": 0.0,
            "company_keywords": [
                "tim",
                "apple"
            ]
        },
        {
            "created_at": 1540992446,
            "text": "While we have covered our $CRTO short position, we don't see evidence yet that the business is bottoming, nor that the stock is a buy. However, seeing that CRTO stock was only $3-$4 away from our price target at its lows, $MED is a far better risk/reward short vs $CRTO .",
            "rating": 0.2732,
            "company_keywords": [
                "target"
            ]
        },
        {
            "created_at": 1539012159,
            "text": "Don't trust us, see for yourself: Why is it that $MED provide their sales reps with super transparent and cautious allergen disclosures , but they do not afford the same level of disclosure to their customers (see for yourself on page 33, as cited).",
            "rating": 0.1025,
            "company_keywords": [
                "trust"
            ]
        },
        {
            "created_at": 1538059803,
            "text": "Medifast (NASDAQ: $MED) Part II\nOptavia Products Are Causing Illness:\nIrrefutable Evidence https://t.co/QXRGxLEPtE",
            "rating": -0.4019,
            "company_keywords": [
                "nasdaq"
            ]
        },
        {
            "created_at": 1537457786,
            "text": "Medifast (NASDAQ: $med ): Like Lumber Liquidators, But With Undisclosed Toxic Metals, and A Supply Chain Twist PART I - https://t.co/C0xVOinHFE",
            "rating": -0.0387,
            "company_keywords": [
                "nasdaq"
            ]
        },
        {
            "created_at": 1516717255,
            "text": "In case you missed it, this was our Quindell PLC report released April 22, 2014: https://t.co/0XSqDBc478 \n\nIn it, we wrote: \"41% of Quindell’s 2011 revenues came from an undisclosed related party (controlled by a QPP executive)\"  (News today relates to Quindell's 2011 accounts)",
            "rating": 0.128,
            "company_keywords": [
                "news"
            ]
        }
    ]
}