{
    "last_updated": 1673755492,
    "tweets": [
        {
            "created_at": 1673293977,
            "text": "Catching up… must be nice to get paid tens of millions of dollars to drive an already ailing business completely into the ground in just 18 months of service. $SFIX\n\nStitch Fix CEO steps down, 20% of salaried workforce to be cut https://t.co/SksnFIYm0o",
            "rating": 0.1779,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1673230242,
            "text": "You have got to me kidding me that there are two public tech companies with no hope of every being profitable w/their consumer business models, but are hoping to make it by co-opting your most intimate personal data w/o you noticing… and their tickers are $YOU and $ME.",
            "rating": 0.7351,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1672942622,
            "text": "It’s amazing how a few people profited so greatly over the total scam that was the $BBBY turnaround thesis. Anyone who knows anything about retail knew that this company was toast a year ago. We still never found out who the dark money behind Jake was! https://t.co/EwxvLbcNVp",
            "rating": 0.4003,
            "company_keywords": [
                "toast"
            ]
        },
        {
            "created_at": 1672778821,
            "text": "Neiman Marcus, are you OK? https://t.co/t0YNbd8Zn2",
            "rating": 0.4466,
            "company_keywords": [
                "marcus"
            ]
        },
        {
            "created_at": 1672778759,
            "text": "Omg they are back with more… if you don’t like the boob box, how about a butt box? https://t.co/tOGQ7Dtxoa",
            "rating": 0.3612,
            "company_keywords": [
                "box"
            ]
        },
        {
            "created_at": 1672773634,
            "text": "Next up… a $400 vibrator… who knew Neiman Marcus sells this…. https://t.co/bQOEKirYXE",
            "rating": 0.0,
            "company_keywords": [
                "marcus"
            ]
        },
        {
            "created_at": 1672773573,
            "text": "#adtech still has a way to go. Or perhaps this is indicative of the new targeting at $META…. Here’s what Neiman Marcus is serving me up in my Facebook feed… First up - a box of boobs https://t.co/tknlKLpeMq",
            "rating": 0.0,
            "company_keywords": [
                "marcus",
                "box"
            ]
        },
        {
            "created_at": 1671415940,
            "text": "If the past two weekends have taught me anything, it’s that Vegas is like Disney World for adults, and Disney World is like Vegas for kids. $DIS $WYNN #tiredAF",
            "rating": 0.6124,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1671166530,
            "text": "So my first Uber driver in Vegas tonight is a former crypto gajillionaire whose ex-business partner ran off with all the money to Thailand. And he pitched a script. Very 2022.",
            "rating": 0.0,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1671116703,
            "text": "Anything short of SBF v Elon in the final two here will be an epic disappointment. https://t.co/1cXx1HDrDx",
            "rating": -0.5106,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1670479304,
            "text": "1 am is a very peaceful time to do your holiday shopping at the Apple Store. Nothing like packing for a morning flight and realizing all your headphones are at an alternate location. 🤦‍♀️ https://t.co/6wg4Ru2AZ0",
            "rating": 0.6228,
            "company_keywords": [
                "apple"
            ]
        },
        {
            "created_at": 1669442295,
            "text": "There’s still more vacancy at this mall than ever historically. And this is an A++. They are getting creative w/filling the space - STEM play center, VR stuff… this $HAS thing is coming… I think EOne did Peppa Pig centers in the U.K. so clearly going for some rev synergies here https://t.co/kneIhb3PSo",
            "rating": 0.8312,
            "company_keywords": [
                "stem"
            ]
        },
        {
            "created_at": 1669441567,
            "text": "Was surprised by line to get into North Face ($VFC). As an aside, the hubby bought a really nice black fleece vest there with front pockets that were giving me mid 2000s Prada vibes. He loves it but wishes he didn’t look like a “Silicon Valley VC douchebag” in it. (His words!)",
            "rating": 0.8747,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1669265303,
            "text": "Whoa…. Huge news for $KER. Not their first rodeo - post Tom Ford was a big transition for Gucci too. What a week for surprise successions!\n\nAlessandro Michele Leaves Gucci - The New York Timestamp https://t.co/qw8BQiEMqO",
            "rating": 0.5848,
            "company_keywords": [
                "news"
            ]
        }
    ]
}