{
    "last_updated": 1673755498,
    "tweets": [
        {
            "created_at": 1672550158,
            "text": "Nice to come across a new Nick Sleep post to bring in 2023. https://t.co/rziUa0jYiE",
            "rating": 0.4215,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1670015453,
            "text": "100%. Too much focus on marginal (at best) tactics; not enough focus on big picture. Regular exercise + common sense health food (\"eat food, mostly plants, not too much\"; modest sugar is okay!) is a simple formula that will work better for most people than zero-sugar, fasting etc https://t.co/beKtVDhxMq",
            "rating": 0.4926,
            "company_keywords": [
                "formula"
            ]
        },
        {
            "created_at": 1669997277,
            "text": "But important to remember that durability is only one of four main contributing factors to a great long term investment in my view. It’s necessary but not sufficient. Other three factors that I emphasize are quality (ROIC), good capital allocation, and value… 4/n",
            "rating": 0.9136,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1668699374,
            "text": "Best podcast I've listened to in a while. Master class on cable, great overview of history, economics, good/bad aspects of business. Interesting view on why Verizon sells broadband (excess capacity), why it might not last (capacity will get eaten fast). Great job @BillBrewsterTBB https://t.co/kTINTE4MLf",
            "rating": 0.9442,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1668615737,
            "text": "Some interesting comments this month from heads of most of the major movie studios. Two common refrains I've been noticing: \n-Direct-to-streaming doesn't work (no sub uplift and huge opportunity cost of theater revenue) \n-Refocusing on theater distribution first, then streaming https://t.co/snAkkUTNRe",
            "rating": 0.7783,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1665675933,
            "text": "Well said. I've had discussions with friends who say they're waiting for stocks to get cheaper and the bad news to subside, but when the bad news subsides stocks will already be much higher. The economic worries from 2009 didn't subside until 2012, when stocks were up 2x https://t.co/YTMoCLcEMh",
            "rating": -0.8442,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1664991884,
            "text": "Nice summary clips of Munger on a big mistake of omission: not buying Belridge Oil when it traded far below the value of the oil field that it owned outright. It became a 30 bagger in 2 years. Part of me wonders if this is \"resulting\" though, because he references an inept CEO https://t.co/Jpms2jjaMB",
            "rating": 0.4215,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1662743835,
            "text": "Nice summary of why $CPRT owns their land. Conservatism leads to a lasting business. Similar to Buffett's logic for holding excess cash: durability. Geico policyholders know claims will always be paid, and Geico knows Copart will always have capacity to auction their vehicles. https://t.co/I2jcnwwAmd",
            "rating": 0.4215,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1660162225,
            "text": "Will only cement the bad logic of using buybacks to “offset dilution”. Issuing stock as comp &amp; using cash to buy back shares are two independent capital allocation decisions that have nothing to do with each other. Linking them together without any regard for price makes no sense https://t.co/psTQJ3P1Rg",
            "rating": -0.5423,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1656010009,
            "text": "Nice little post mortem on $GOOG by @farnamjake1; and comments on base rates (good to keep in mind even for a baserate-defying juggernaut like Google). Interestingly, the EBIT multiple now (16x) is lower than where it was in 2015 when his case study began \nhttps://t.co/98k9BQYxER https://t.co/xWo7trBKYL",
            "rating": 0.7003,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1654917209,
            "text": "This is a really fun NBA finals. Boston is a great team, a true team with all kinds of depth. I hope Brad Stevens gets his well-deserved title. But it's also nice to see Golden State with the original trio back in the finals. Steph is still at the top of his game",
            "rating": 0.9387,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1654258318,
            "text": "Goldman and Blackrock are building alternative asset businesses that are small relative to their core but still sizable in relation to the other private equity players \n$GS $BLK $KKR https://t.co/kQCgrYvy2B",
            "rating": 0.1901,
            "company_keywords": [
                "blackrock"
            ]
        },
        {
            "created_at": 1653103613,
            "text": "It’s a great point. Buffett had every opportunity to clone Graham’s strategy (which would have been a logical &amp; probably successful path) but adapted and chose to go in a new direction. He never outsourced his thinking, which was my major takeaway from that book. Great bookshelf https://t.co/UGDqf12yN3",
            "rating": 0.91,
            "company_keywords": [
                "graham"
            ]
        },
        {
            "created_at": 1653089641,
            "text": "Nice thread on $CPRT and their competitive advantages by @Quartr_App, which I actually used to listen to the earnings call on this morning’s run. https://t.co/MEUoCiqOMe",
            "rating": 0.7184,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1653065082,
            "text": "I've been noticing a widening gap between starter home sales vs high end. Some noise is caused from appreciation and homes \"moving\" into higher value categories, but this looks mostly like a tale of two cities between starter and high end housing turnover https://t.co/Zja5j28pxV",
            "rating": 0.7269,
            "company_keywords": [
                "gap",
                "two"
            ]
        },
        {
            "created_at": 1652474413,
            "text": "Some incredible high school track athletes right now. Sub 4 milers, 13:43 5k, 8:35 two milers, and now this: 19.49 200! https://t.co/3Cf5yhX91n",
            "rating": 0.0,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1650333975,
            "text": "$NVR is an all-time great, buying back 78% of its shares last 30 yrs\nSince 2005 (top of last housing mkt) NVR repurchased 51% of its shares\nBut the big box housing suppliers did better: it's interesting that $HD repurchased 53% of its shares &amp; $LOW repurchased 57% since '05",
            "rating": 0.9319,
            "company_keywords": [
                "box"
            ]
        },
        {
            "created_at": 1649994868,
            "text": "These Chick-fil-A numbers are just mind boggling. Like the 1927 Yankees. Their average unit volumes are so much bigger than the typical fast food franchise, which is especially impressive considering they have over 2,000 locations and do $12 billion or so in system wide sales https://t.co/y6jXke9Xm2",
            "rating": 0.7264,
            "company_keywords": [
                "unit"
            ]
        }
    ]
}