{
    "last_updated": 1673755489,
    "tweets": [
        {
            "created_at": 1670975268,
            "text": "SEC files lawsuit against Atlas Trading and @MrZackMorris. $CEI discussed p. 17-24 https://t.co/iLUzmsHn93",
            "rating": -0.2263,
            "company_keywords": [
                "atlas"
            ]
        },
        {
            "created_at": 1663256853,
            "text": "Saturday’s launch was a test sat – the ~8x larger production version, Bluebird1 (BB1), which is needed to deliver the service and financials $ASTS has promised, is two years late and our checks point to further costly delays ahead (3/8)",
            "rating": 0.2732,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1663256821,
            "text": "Skepticism from the space and satcom experts we interviewed surrounds nearly every aspect of AST’s plan: spacecraft design, quality of service, addressable market, and ability to execute against competition from SpaceX and Apple (2/8)",
            "rating": 0.0772,
            "company_keywords": [
                "apple"
            ]
        },
        {
            "created_at": 1653665925,
            "text": "$MRTX G12C inhibitor is a failure, stock -34%. On duration of response and toxicity, the latest data strongly confirms adagrasib's inferiority to Amgen's Lumakras. Sad news for patients, but hard to imagine Mirati getting any traction on adagrasib after this https://t.co/T73bwEgHv9",
            "rating": -0.6059,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1650466974,
            "text": "$DWAC’s ability to close its merger with TMTG is threatened along two distinct but inextricably linked regulatory paths: the need for an effective S-4 regarding the proposed merger, and the active SEC investigation into material misstatements contained in $DWAC’s S-1. (4/9)",
            "rating": 0.81,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1650466918,
            "text": "The SEC has been handed a prime opp to send a message to the industry. Not only is $DWAC and TMTG high-profile, but the deal involves a repeat offender. $DWAC’s sponsor is an obscure Chinese firm that has seen three of its shell companies killed by the SEC in the past. (3/9)",
            "rating": -0.8885,
            "company_keywords": [
                "shell"
            ]
        },
        {
            "created_at": 1640801312,
            "text": "Another critical view on $ASTR from an industry expert https://t.co/VGVDhn4t17",
            "rating": -0.3182,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1640185085,
            "text": "Yet HubSpot’s products – a set of tools to help SMBs acquire customers online – are nothing special. Online reviews are blah, products are flawed, pricing is expensive, many alternative solutions are available in the market 3/7",
            "rating": 0.1882,
            "company_keywords": [
                "hubspot"
            ]
        },
        {
            "created_at": 1640185012,
            "text": "HubSpot’s growth decelerated for years prior to Covid. Only during the pandemic, when SMBs scrambled to go digital, did growth turn around and HubSpot’s historically pedestrian multiple suddenly soar 2/7 https://t.co/xNetdpHz6T",
            "rating": 0.6369,
            "company_keywords": [
                "hubspot"
            ]
        },
        {
            "created_at": 1631203303,
            "text": "“Chalk up a pyrrhic victory for the Principia Biopharma short sellers. After arguing [its] pipeline was worthless, short sellers saw Sanofi snap up the biotech… in a $3.7 billion deal. Now, rilzabrutinib… flunked its first major clinical test.” We were right in the end on $PRNB https://t.co/HyjZo4m6k0",
            "rating": -0.8402,
            "company_keywords": [
                "now"
            ]
        }
    ]
}