{
    "last_updated": 1673755493,
    "tweets": [
        {
            "created_at": 1673711839,
            "text": "I’m still digesting the gaslighting of the narrative change from “Tesla will sell every car it can make at a super high margin for the next decade” to “We will sell most of the capacity of four plants by slashing margins massively in 2023” is somehow incrementally better. https://t.co/zh8sMM2lQm",
            "rating": 0.6908,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673710919,
            "text": "Why doesn’t $AAPL cut the price of iPhones by 40% and get the unit growth going again? https://t.co/VfrQu1jdwm",
            "rating": 0.128,
            "company_keywords": [
                "unit"
            ]
        },
        {
            "created_at": 1673664042,
            "text": "Spotted;   Ross Gerber preparing for his Tesla debate with @WallStCynic https://t.co/LTHBAjq0sS",
            "rating": 0.0,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673637375,
            "text": "Now Yous Can't Leave https://t.co/EEhvvrTTuV",
            "rating": 0.0382,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1673628797,
            "text": "You absolute moron.  EV battery costs went up 7% last year largely due to higher material costs such as lithium.  Jamming twice as many Panasonic laptop batteries into Tesla battery backs doesn't reduce the cost of mining or the other multitude of cost drivers.  No shame. https://t.co/HU7MfP1aHO https://t.co/6YIXUcIym2",
            "rating": -0.8271,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673621044,
            "text": "Spotted:  @CGrantWSJ trying to hold his Twitter tongue being off the Tesla beat for a while now. https://t.co/JQiN5eXMQN",
            "rating": 0.0,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673620713,
            "text": "Gary, no disrespect intended,  but a mere month ago you were arguing that that the Dec promotions weren't bad news because they were only for a few weeks.  Now with massive worldwide cuts, it's somehow great news?  Serious Q: is there literally any scenario that isn't a positive? https://t.co/kVtedw27ey https://t.co/Y7Jp7GEcXX",
            "rating": -0.5531,
            "company_keywords": [
                "news",
                "now"
            ]
        },
        {
            "created_at": 1673616110,
            "text": "Another problem Tesla just created for itself is all the cars coming off lease in the next year.  Even if they offer a buyout option, the residual values just took a huge hit with the one-two bunch of tanking used prices and slashed new prices.   FYI this is car company 101 shit.",
            "rating": 0.0857,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673615476,
            "text": "Tesla wouldn’t be tanking PPPre-market if Ross Gerber was on the board and could explain these massive PPPrice cuts in a weekly PPPress briefing. https://t.co/AF0fEY36nb",
            "rating": -0.296,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673615184,
            "text": "Tesla isn’t a car company.  You shut your whore mouth! https://t.co/ToMSfozWOQ https://t.co/6O1qTiRj8a",
            "rating": -0.68,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673614325,
            "text": "Also, as @StanphylCap rightly pointed out,  Tesla’s only material profit center is EVs.   Other car companies have massive and efficient ICE (and hybrid) businesses that generate cash.  They are essentially immune to an EV “price war” at this time. https://t.co/B9gv1yt03o",
            "rating": 0.7845,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673614098,
            "text": "Evercore estimates $3-3.50 per share in EPS for Tesla (way below consensus and Gary Black, and Ross “Gary Does The Numbers” Gerber).  And this assumes the prices cuts are TEMPORARY.  At the midpoint ($3.25) $TSLA is at 38x forward.  If full year cut probably closer to 50x.  1/2 https://t.co/4VYGo7CqmV https://t.co/MXX7BlJ4QM",
            "rating": -0.2732,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673609336,
            "text": "Spotted:  The Hertz CFO watching used Tesla prices that were already dropping 3x the rate of other used cars after this latest massive price cut. https://t.co/GbgDnx7zhl",
            "rating": -0.2732,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673572150,
            "text": "Who will be delivering DoorDash the soonest?",
            "rating": 0.0,
            "company_keywords": [
                "doordash"
            ]
        },
        {
            "created_at": 1673570037,
            "text": "Just amazing what a hollow shell @SEC_Enforcement has become, such that the subjects of their enforcement actions just openly mock and dunk on them.  I had thought Musk’s antics were the peak but plenty of other dildos are stepping into the ring. @GaryGensler https://t.co/jy92ON3V8Y",
            "rating": 0.128,
            "company_keywords": [
                "shell"
            ]
        },
        {
            "created_at": 1673537816,
            "text": "If $BBBY had $500M of \"total liquidity\" as of Nov 30, and is burning about $300M/Q.  That would put them at cash zero around April, all else equal.  Although any supplier without rocks for brains (amirite $HELE) should have them on COD terms now.  My guess is a Feb filing.",
            "rating": 0.0,
            "company_keywords": [
                "nov"
            ]
        }
    ]
}