{
    "last_updated": 1673755496,
    "tweets": [
        {
            "created_at": 1673737454,
            "text": "It’s really too bad that there will likely never be a third season of Mindhunter (the David Fincher show on Netflix) 😔 https://t.co/wYP2xYUh73",
            "rating": -0.5829,
            "company_keywords": [
                "netflix"
            ]
        },
        {
            "created_at": 1673534900,
            "text": "\"JPMorgan Chase on Thursday shut down the website for a college financial aid platform it bought for $175 million after alleging that the company’s founder created nearly 4 million fake customer accounts.\" 😬",
            "rating": -0.2732,
            "company_keywords": [
                "chase"
            ]
        },
        {
            "created_at": 1673449403,
            "text": "Today's free post: \n\n373: Microsoft + OpenAI, Apple vs Qualcomm &amp; Broadcom, EVs, Buffett Energy Bets, Plane Shortage, Cancer Vaccine, and B-21 Raider\n\n🔗 https://t.co/6NwO0DXlVn",
            "rating": -0.25,
            "company_keywords": [
                "apple",
                "broadcom"
            ]
        },
        {
            "created_at": 1673440752,
            "text": "Or is it just that we’re more aware of it because of instant global news on Twitter?",
            "rating": 0.0,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1673365307,
            "text": "No big surprises in the top 10 most popular services online: https://t.co/UX2pHPY9IO",
            "rating": 0.5563,
            "company_keywords": [
                "popular"
            ]
        },
        {
            "created_at": 1673365305,
            "text": "About 1/3 of traffic is coming from bots. The top 10 sources of bot traffic surprised me a bit (I just didn't think the British Virgin Islands and Seychelles even had that much bandwidth to begin with..): https://t.co/HRIjjh6bey",
            "rating": 0.4019,
            "company_keywords": [
                "bandwidth"
            ]
        },
        {
            "created_at": 1673365305,
            "text": "Cloudflare's review of the state of the internet in 2022:\n\nTraffic up 23%: https://t.co/NfVaciqaXK",
            "rating": 0.0,
            "company_keywords": [
                "cloudflare"
            ]
        },
        {
            "created_at": 1673286144,
            "text": "Sony has a joint venture with Honda to make EVs with autonomy features, AR/VR, entertainment, etc...\n\nToo bad they picked that brand name for it, though.. 😬 https://t.co/m7HQq3hjn7",
            "rating": -0.1779,
            "company_keywords": [
                "joint"
            ]
        },
        {
            "created_at": 1673039579,
            "text": "It's easy to forget what an influential company Hewlett-Packard (HP) was in its heyday 🤔",
            "rating": 0.5994,
            "company_keywords": [
                "hp"
            ]
        },
        {
            "created_at": 1673018566,
            "text": "The podcast market seems to be correcting, at least when it comes to how much big cos will spend to acquire very popular shows.\n\nBut when it comes to top podcast turnover (the top charts are fairly stable), I don't think there's the problem that some see: https://t.co/hEL4UszTJs",
            "rating": 0.2255,
            "company_keywords": [
                "popular"
            ]
        },
        {
            "created_at": 1672684269,
            "text": "Close up of weird moss on tree bark. I think it’s interesting visually https://t.co/tNJt9ophc6",
            "rating": 0.25,
            "company_keywords": [
                "bark"
            ]
        },
        {
            "created_at": 1672625260,
            "text": "I just finished the book. It was pretty decent. Nice behind-the-scenes look and anecdotes about making the film. If you’ve seen the film as many times as I have, you’d probably enjoy it as comfort food reading.",
            "rating": 0.8934,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1672372675,
            "text": "Took a walk with my family on parliament hill in Ottawa tonight. They were looking at the parliament building, but all I could think of was, that’s a nicely designed lamp… nice proportions and details. I wonder who made it 🤔 https://t.co/UdHvYx6Hvr",
            "rating": 0.8201,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1672367408,
            "text": "The scenes with Marcus and Syd were great too -- love when interesting characters are taken to new places, new rhythms, new duos.. \n\nHer speech about trying the best restaurants in NYC was well-written and acted. https://t.co/x2fzLqOSy9",
            "rating": 0.9451,
            "company_keywords": [
                "marcus"
            ]
        }
    ]
}