{
    "last_updated": 1673755489,
    "tweets": [
        {
            "created_at": 1673311986,
            "text": "Those two tweets reminded me of this classic: https://t.co/suDRLrG1WX",
            "rating": 0.0,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1673311940,
            "text": "These two tweets reveal everything about Citadel https://t.co/JhagoFGLWK",
            "rating": 0.0,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1672795626,
            "text": "There are two managers who were substantially below their high water marks - and for a long time...\n\nboth of them got back above in 2022...\n\nAnd AFAIK little to no outside capital stayed for the recovery",
            "rating": -0.2315,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1672727387,
            "text": "LEX BANK-FRIEDMAN IS NICE LEAVE HIM ALONE YOURE JUST JEALOUS https://t.co/kKqa1ZA9Xi",
            "rating": -0.5948,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1672726706,
            "text": "LEX FRIDMAN IS THE NICEST GUY THEREFORE HE CAN’T BE A FRAUD \n\nCan you name a single fraudster that isn’t “nice”? What, do you think they fraud with a gun? No their weapon of choice is a smile. \n\nAsk SBF",
            "rating": -0.9111,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1672623536,
            "text": "This reminds me of the @GretaThunberg quote tweet of that Tatertot misogynist\n\nShe didn’t spell out a perfect thesis as to why Tate is bad. But her target selection was correct. \n\nSimilar dynamic here. Taleb might be obsessing over the wrong tweet, but he’s right on the target https://t.co/S3D7zp0gSw",
            "rating": -0.5789,
            "company_keywords": [
                "target"
            ]
        },
        {
            "created_at": 1672621516,
            "text": "RT @Tweetermeyer: But wait, it gets even weirder: the paper in question, entitled \"The Human Side of Tesla Autopilot\" isn't even listed at…",
            "rating": 0.2263,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1672621467,
            "text": "RT @Tweetermeyer: Remember when @lexfridman authored a study showing that Tesla Autopilot didn't negatively impact the \"functional vigilanc…",
            "rating": 0.0,
            "company_keywords": [
                "tesla"
            ]
        }
    ]
}