{
    "last_updated": 1673755489,
    "tweets": [
        {
            "created_at": 1645633017,
            "text": "RT @MarcRuby: Hedge funds not having an easy time, according to GS. \"The most popular hedge fund long positions have suffered their worst 1…",
            "rating": -0.7659,
            "company_keywords": [
                "popular"
            ]
        },
        {
            "created_at": 1641327420,
            "text": "Charlie Munger doubled down on his $BABA stake (again) in Q4 per Daily Journal 13F. Now owns $71mn worth https://t.co/rRiRlwzdH8",
            "rating": 0.2263,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1638471177,
            "text": "New Graham &amp; Doddsville newsletter out. Features great interview with Gavin Baker of Atreides https://t.co/AdzLma5BV9",
            "rating": 0.6249,
            "company_keywords": [
                "graham"
            ]
        },
        {
            "created_at": 1637602255,
            "text": "A lot of these names are actually up &amp; rest are not down nearly as much as other popular hf growth stocks. https://t.co/FkpMoipir4",
            "rating": 0.6597,
            "company_keywords": [
                "popular"
            ]
        },
        {
            "created_at": 1629925373,
            "text": "\"Listen, you're gonna lose money, ok?  You're gonna take risk, you're gonna lose money.  I think the three things is liquidity, leverage, and concentration ...    If you have one of them, maybe it works.  If you have two of them, 'uh oh’ ...",
            "rating": -0.6486,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1628267851,
            "text": "Third Point’s Q2 letter out. New position in $RH. Also talks $DIS &amp; $S https://t.co/IzW574zOrm",
            "rating": 0.0,
            "company_keywords": [
                "rh"
            ]
        },
        {
            "created_at": 1628023342,
            "text": "\"When people talk about margin of safety in investing, they usually talk about things that are financial in nature: asset value or sustainable return on equity.  I'm much more focused on nature of business franchise and the replicability of that &amp; the quality of ppl running it.\"",
            "rating": 0.8622,
            "company_keywords": [
                "ppl"
            ]
        },
        {
            "created_at": 1618259205,
            "text": "Normally listen to podcasts sped up but had to do this one normal speed it was so full of insight. If you’re not following these two you should probably correct that. Ted’s podcast is excellent and Yen has been a fantastic recent addition to Fintwit discourse. https://t.co/kOX1L3MUNv",
            "rating": 0.899,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1613422553,
            "text": "Think it was Jeff Ubben who once said if you try to trade around a position, you now have to get *two* decisions correct (the exit &amp; the re-entry) making things twice as difficult to execute. https://t.co/VYQPNlQUIr",
            "rating": -0.3612,
            "company_keywords": [
                "two"
            ]
        }
    ]
}