{
    "last_updated": 1673755489,
    "tweets": [
        {
            "created_at": 1673618291,
            "text": "Very cool. Buck is as high signal as it gets, so nice to see him drawn out a little more in this format. https://t.co/jZwg74FNQW",
            "rating": 0.7359,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1673539135,
            "text": "Good piece. I focus on share issuance since FCF/share is the KPI. These cos issuance range from high (Uber) to wtaf (Lyft). Excuses of 2021 talent war/2022 reduced attrition are meh. DASH/Lyft cut heads which may slow issuance. Uber so far hasnt bc they were the “soberest drunk”. https://t.co/yaExUreSFo",
            "rating": 0.6705,
            "company_keywords": [
                "lyft"
            ]
        },
        {
            "created_at": 1673537346,
            "text": "Barclays currently gives the spec retail industry a D for inventory management (based on spread of sales dollar growth to inventory growth) but sees grade inflation ahead https://t.co/1HAfnVf7qH",
            "rating": 0.2023,
            "company_keywords": [
                "barclays"
            ]
        },
        {
            "created_at": 1673475891,
            "text": "Microsoft already pitches retailers on Azure over AWS because of Amazon. Now trying to use RMN platform too. \n\nGoogle was reported working on a solution last year, but haven’t heard much about it since. https://t.co/W3jkgKlpnm",
            "rating": 0.25,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1673393819,
            "text": "Netflix is notoriously a unique culture. That they would allow or perhaps even commission an article like this seems to imply that they were in big PR mode last summer, wanting to take back control of the narrative that they had worked so hard to cultivate over time.",
            "rating": 0.3682,
            "company_keywords": [
                "netflix"
            ]
        },
        {
            "created_at": 1673393423,
            "text": "Netflix allowed a New Yorker reporter to trail Bela Bajaria, and the obvious Q is why. Given the timing, post Q1 blowup at the trough of despair, with stories about how content had changed/worsened under Bajaria, it was meant to be a show of support?\n\nhttps://t.co/x4S0cf15e1",
            "rating": 0.1027,
            "company_keywords": [
                "netflix"
            ]
        },
        {
            "created_at": 1673034334,
            "text": "Before the internet, there were encyclopedias, and parents. Then there was Google. Now there’s a chatbot that sometimes sounds erudite. They all helped you do homework, none help you pass tests.",
            "rating": -0.3089,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1673034118,
            "text": "The solution is to not view homework as an end unto itself, which when I was in school was def the case. When someone takes tests, or is called upon in class, if they have used ChatGPT and not learned the material themselves, they will do poorly. https://t.co/Tb0NrWgAr4",
            "rating": 0.3182,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1672871292,
            "text": "Just seeing that UBS raised top and bottom line estimates for MSFT. I can only assume investors cheered this positive revision. https://t.co/SDQxe9q15M",
            "rating": 0.8537,
            "company_keywords": [
                "ubs"
            ]
        },
        {
            "created_at": 1672855535,
            "text": "South Park did an episode called HUMANCENTiPAD about how Apple jams whatever they want into the TOS. I guess Europe is saying that you can't use TOS to set the terms of delivering your own service? \n\nhttps://t.co/XvDl5gLKHK",
            "rating": 0.0772,
            "company_keywords": [
                "apple"
            ]
        },
        {
            "created_at": 1672788011,
            "text": "\"But, paradoxically, crypto is much more reliant on trust than the rest of finance and business. It only works if people believe in it.\"\n\nfrom @matt_levine postscript to the crypto story \n\nhttps://t.co/IOSscz7S2r https://t.co/YFMIC9RRWD",
            "rating": 0.6549,
            "company_keywords": [
                "crypto",
                "trust"
            ]
        },
        {
            "created_at": 1672678866,
            "text": "RT @costareports: An extraordinary moment in American history. A speaker of the House asks the chairman of the joint chiefs if the nuclear…",
            "rating": 0.0,
            "company_keywords": [
                "joint"
            ]
        },
        {
            "created_at": 1671654696,
            "text": "When people talk about regimes post GFC, I dont view it as all one up to the vaccine or 2/12/21. I think either Vixplosion or for sure 1/4/19 Powell speech as beginning of hyper TAM regime. Yes, tech did well the whole time, but it was short sharp period 19-21 that was outlier.",
            "rating": 0.4678,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1671546870,
            "text": "At 3-3.25% churn, Netflix monthly gross ads in US are ~2-2.2M. Antenna says 9% of gross ads were Ad tier, ~200K. 43% were trade downs, ~85K, and 57% were new or returning. Think new/returning is interesting number to watch for incremental demand, 120k/mo seems meh but it's early.",
            "rating": -0.3612,
            "company_keywords": [
                "netflix"
            ]
        },
        {
            "created_at": 1671223171,
            "text": "worries about subprime auto loans are like cicadas. i'm sure this time it's actually worse than these past times because the prices of cars was in fact bonkers, but we do do this every two years. https://t.co/uG08Nm1twP",
            "rating": -0.1406,
            "company_keywords": [
                "two"
            ]
        }
    ]
}