{
    "last_updated": 1673755492,
    "tweets": [
        {
            "created_at": 1668781770,
            "text": "As discussed in our previous $ASLE report, due to AerAware’s highly attractive unit economics (&gt;60% gross margins), just one large order will be transformative for the Co’s financial performance &amp; by itself would result in an almost doubling of annual EPS https://t.co/qFeW8ESurK",
            "rating": 0.024,
            "company_keywords": [
                "unit"
            ]
        },
        {
            "created_at": 1668781764,
            "text": "1/ We reiterate our Strong Buy recommendation for $ASLE shares with a price target of $47, and continue to believe that @AerSale shares could exceed $100 over the long-term.",
            "rating": 0.7717,
            "company_keywords": [
                "aersale",
                "target"
            ]
        },
        {
            "created_at": 1662551146,
            "text": ".@MiMedx's decision to replace CEO Tim Wright is a HUGE step in the right direction. During our most recent campaign, shareholders clearly expressed their discontent w/ $MDXG's mismanagement &amp; we are thrilled to see the Board respond by making much needed changes.",
            "rating": 0.824,
            "company_keywords": [
                "tim"
            ]
        },
        {
            "created_at": 1654020816,
            "text": "Nonetheless, the $MDXG Board has continued to reward mgmt handsomely with massive and undeserved stock grants, including a recent grant of 603,000 restricted shares to CEO Tim Wright",
            "rating": 0.8625,
            "company_keywords": [
                "tim"
            ]
        },
        {
            "created_at": 1654020814,
            "text": "Today we issued a presentation on $MDXG detailing the massive value destruction under the current Board &amp; mgmt. This reinforces our decision to WITHHOLD our votes against two Board members &amp; vote AGAINST the executive comp pkg. Full presentation here: https://t.co/hHEm8ZqiOn",
            "rating": -0.3182,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1652878718,
            "text": "We intend to send a message that the repeated failures and deficiencies of the $MDXG Board and management will not be tolerated by shareholders, by voting #WITHHOLD against two directors and voting NO on the Company’s excessive and undeserved executive compensation.",
            "rating": -0.7125,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1651843464,
            "text": "$MDXG's share price is down over 70% from its peak largely as a result of mismanaged clinical trials, value-destructive decisions, and poor investor communication. Yet the Board recently granted millions of dollars in stock to CEO Tim Wright and other senior managers. #Withhold",
            "rating": 0.0258,
            "company_keywords": [
                "tim"
            ]
        },
        {
            "created_at": 1651842946,
            "text": "Today we issued a letter to $MDXG shareholders announcing that we are voting to WITHHOLD  the election of two directors, James Bierman and Phyllis Gardner up for election at the @MiMedx annual meeting on June 7. Read the full letter here: https://t.co/zN7WnmuyhQ #WthholdAll",
            "rating": 0.0,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1643827809,
            "text": "$GRPN ‘s new disclosure confirms this is a huge hidden asset and combined with news of @SumUp 's proposed equity round, a ~$15/share value is no longer conjecture but actually in-line with our original bull case of ~$14/share (yes, we know in a roundabout way).",
            "rating": 0.6652,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1643827809,
            "text": "While our ownership % proved to high, based on publicly available info/intel we had, “mid-single-digits” seemed to be a reasonable estimate.  More importantly, two months ago most investors hadn’t even heard of @SumUp or were aware $GRPN had a stake.",
            "rating": 0.3804,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1643827808,
            "text": "Yes, we are adding. Looks like hot money capitulation on what is fundamentally positive news. Thesis was always 2 pronged: (1) @SumUp was a valuable hidden asset &amp; (2) $GRPN ‘s core biz is significantly undervalued trading at trough multiples on trough earnings. https://t.co/hiza7cgqpj",
            "rating": 0.9246,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1643812369,
            "text": "Positive Catalyst #1) Currently the sell side excludes $GRPN ‘s @SumUp stake from their $GRPN valuation models.  Public confirmation of the stake and SumUp’s recently disclosed valuation will spur a series of imminent upgrades and price target increases https://t.co/CyvpbSuhuq",
            "rating": 0.5574,
            "company_keywords": [
                "target"
            ]
        },
        {
            "created_at": 1643812369,
            "text": "$GRPN ’s confirmation of its @SumUp stake removes any uncertainty regarding its materiality, and we expect this news will be the spark that sets off a series of positive catalysts that will drive Groupon shares higher in short order.",
            "rating": 0.6486,
            "company_keywords": [
                "groupon",
                "news"
            ]
        },
        {
            "created_at": 1643812262,
            "text": "Given $GRPN ‘s 2.4% stake &amp; news that @SumUp is seeking to raise capital at a $22.5Bn valuation, we now have more certainty that $GRPN ’s stake is worth ~$500 million or $14.58/share (i.e., &gt;50% $GRPN 's mkt cap)",
            "rating": 0.4927,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1643812262,
            "text": "In response to our campaign for transparency, $GRPN ystrday disclosed a 2.4% stake in @SumUp, confirming our thesis that $GRPN ’s @SumUp stake was a hidden asset w/ tremendous value. See report 4 details on this great news. Revised PT ~$70/sh  https://t.co/mpKO4ohwH3 https://t.co/Ta4nGUtW0o",
            "rating": 0.8682,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1643639000,
            "text": "Catalyst #2 - Once $GRPN confirms its @SumUp Ownership stake the sell side will be forced to include Groupon’s @SumUp stake in their valuation models, spurring a wave of price target increases.",
            "rating": -0.4588,
            "company_keywords": [
                "groupon",
                "target"
            ]
        },
        {
            "created_at": 1643638996,
            "text": "We are raising our $GRPN PT to $88.17, 3.2x the current share price, given recent news that @SumUp seeks to raise equity at a $22B valuation. This is the 1st public data point regarding SumUp’s valuation &amp; we est. $GRPN’s windfall could be &gt;$1B, more than its current market cap",
            "rating": 0.296,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1643313368,
            "text": "🙏@barronsonline We were the first to expose $GRPN ‘s secret asset in @SumUp, which we valued @ $14/sh. Now everyone is talking abt @SumUP after its latest financing indicates $GRPN ‘s @SumUp inv. alone is &gt;$33/sh. If you missed our note then, act now, this mispricing won't last https://t.co/EtUbemH8XJ",
            "rating": 0.1531,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1643303823,
            "text": "RT @realwillmeade: $GRPN Groupon there’s always a bull market somewhere.\nOne hedge fund Prescience Point says $GRPN is worth almost $100 a…",
            "rating": 0.2263,
            "company_keywords": [
                "groupon"
            ]
        },
        {
            "created_at": 1643297083,
            "text": "RT @absurdtrader: @LeveredMonkey Otherwise @PresciencePoint did the most digging about the sum up stake, more info on their website",
            "rating": 0.0,
            "company_keywords": [
                "sum"
            ]
        },
        {
            "created_at": 1640875227,
            "text": "As the old adage goes “In the land of the blind, the one-eyed man is king.” We hope this thread will open the eyes of @JPMorgan @Wedbush &amp; @Barclays, for a halfway competent sell-side would represent a marked improvement from the current predicament where the blind lead the blind",
            "rating": 0.0258,
            "company_keywords": [
                "barclays"
            ]
        },
        {
            "created_at": 1640875226,
            "text": "Just as inept, JP Morgan &amp; Barclays lowered their $GRPN price targets 2 weeks ago, but neither accounted for @SumUp in their $GRPN valuation. We won’t quibble about their core biz estimates, but how can a firm propagate price targets of a biz they don't fully understand https://t.co/eoemLk5cTa",
            "rating": 0.1322,
            "company_keywords": [
                "barclays"
            ]
        },
        {
            "created_at": 1640875225,
            "text": "In Q3 21, $GRPN reported the highest seasonal GAAP EPS in its history! Glancing at the Income Statement, the @SumUp writeup is brazenly obvious! Yet, neither of the two analysts on the earnings call asked about @SumUp or discussed it in post-earnings notes. https://t.co/5QiOAGXvTc",
            "rating": 0.0,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1640875224,
            "text": "While @SumUp is tight lipped about its parabolic growth, $GRPN has disclosed its SumUp investment multiple times; it should be common knowledge. $GRPN wrote up the book value of its @SumUp investment twice in the past two years and mentioned it by name as recently as Q4 19. https://t.co/vgNMavQTtI",
            "rating": 0.6124,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1640875222,
            "text": "Shockingly, our estimate of 50% rev growth may be too conservative. In July 2019 @SumUp execs said rev doubled in two consecutive years (i.e., 4X in 2 yrs). $GRPN holds a hidden jewel that would make top VC firms envious. Truly a once in a blue moon opp. for public mkt investors https://t.co/ClXDGk5E71",
            "rating": 0.7184,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1640875217,
            "text": "This is why Wall St research is💀'ing. Incompetent analysts covering $GRPN at @jpmorgan @barclays @wedbush failed to attribute any value to $GRPN's stake in @SumUp when $GRPN was just forced to mark up its stake $90m, now a $123m asset on its balance sheet. $GRPN has &gt;167% upside",
            "rating": -0.6705,
            "company_keywords": [
                "barclays"
            ]
        },
        {
            "created_at": 1640096445,
            "text": "$GRPN is an ignored and misunderstood company.  Three years ago, nine analysts joined the earnings calls, today there are two.  With the stock near all-time lows, short interest is historically elevated as bears have failed to re-evaluate their antiquated short thesis.",
            "rating": -0.7003,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1640096441,
            "text": "Most people think @Groupon $GRPN is dead (we did). However, it has a valuable secret asset, revamped core biz poised for accelerated growth, &amp; a surprisingly loyal user base. We think it's worth 2.7x-4.3x the current share price. Full Report Here:  https://t.co/12tErDm7N8",
            "rating": 0.9062,
            "company_keywords": [
                "groupon"
            ]
        }
    ]
}