{
    "last_updated": 1673755491,
    "tweets": [
        {
            "created_at": 1673271352,
            "text": "I'll be honest: when I saw the CNBC headline \"Flo Rida sues Celsius\" I assumed he had lost money on crypto, and was upset by the treatment of customer deposits in bankruptcy.",
            "rating": -0.1531,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1672668873,
            "text": "I think product launches tell you a lot about how firms view themselves. Are they a boutique or a supermarket? Are they an artisan or a manufacturer? \n\nThere isn't a right or wrong approach, but many firms suffer from cognitive dissonance with respect to their own business models",
            "rating": 0.1373,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1672668870,
            "text": "Large asset managers will launch products based on trailing flows (e.g. the current proliferation of explicitly ESG products).\n\nBut a lot of resources are still getting dedicated to launching and growing [random style box product].",
            "rating": 0.7783,
            "company_keywords": [
                "box"
            ]
        },
        {
            "created_at": 1672413713,
            "text": "Started legging into software a bit too early (started buying more aggressively in 2Q) but took a basket approach and think I've traded the group decently well. Not without misses (OKTA...) but had some nice beats too.",
            "rating": 0.5878,
            "company_keywords": [
                "nice"
            ]
        },
        {
            "created_at": 1672413712,
            "text": "Didn't own coal this year (well, I had some Glencore at the start of the year)... \n\n@YellowLabLife has been all over the coal trade, and I just missed it.",
            "rating": -0.296,
            "company_keywords": [
                "glencore"
            ]
        },
        {
            "created_at": 1672413710,
            "text": "Related - Netflix. I successfully pitched this to my boss, and it worked well. \n\nBut I didn't buy it myself. With META and AMZN in a 15-20 name product... optics were a consideration. I wish I could say otherwise.",
            "rating": 0.7351,
            "company_keywords": [
                "netflix"
            ]
        },
        {
            "created_at": 1672413709,
            "text": "I was fairly opportunistic buying this thing. I was fully prepared for considerable depreciation in the Ruble and a deep recession. Thought Crimea was a good stress test.\n\nBut I did not think trading would be suspended in a Nasdaq listed, Netherlands domiciled company.",
            "rating": -0.6655,
            "company_keywords": [
                "nasdaq"
            ]
        },
        {
            "created_at": 1671795269,
            "text": "The view count addition to Twitter is interesting. \n\nI am amused, yet skeptical, that my random, midwit thoughts generate impressions inline with @CapitalGroup / @PIMCO / @blackstone \n\nThese accounts all have 125k - 250k+ followers.",
            "rating": 0.6249,
            "company_keywords": [
                "blackstone",
                "view"
            ]
        },
        {
            "created_at": 1671590967,
            "text": "How you justify Glencore in your ESG product: https://t.co/T8qrBWxNiL",
            "rating": 0.0,
            "company_keywords": [
                "glencore"
            ]
        },
        {
            "created_at": 1670594448,
            "text": "I have been slightly surprised that companies who put out 2023 guidance (either explicitly, or implied like ADSK / ZI) have not been rewarded. \n\nBut the group seems to trade more off macro data points than company specific news. Could say the same of many sectors recently.",
            "rating": 0.0617,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1670594444,
            "text": "Meaningful dispersion in the Bravo Bundle. Twilio managed to self-destruct, while SPLK and OKTA exhibited signs of stabilization.\n\nAnd COUP is now going through some sort of publicly negotiated sales process. https://t.co/MdRl9jfvDh",
            "rating": 0.3182,
            "company_keywords": [
                "twilio"
            ]
        },
        {
            "created_at": 1670594443,
            "text": "Now that we are largely through off cycle earnings, time to update - https://t.co/WtdmjBfLV6",
            "rating": 0.0,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1670415755,
            "text": "BLK has argued for years that they’re not a SIFI. And they’re not. But they are… something. \n\nAnd Larry Fink’s public stances are going to force regulators to ask what exactly BlackRock is. And how it should be regulated.",
            "rating": -0.1901,
            "company_keywords": [
                "blackrock"
            ]
        },
        {
            "created_at": 1669390773,
            "text": "Happy day after Thanksgiving, one of those special days when you get to wonder whether a stock is moving due to news or an orthodontist in Peoria trading his PA.\n\nDay after Thanksgiving, week between Christmas and New Year's... do we really need the markets to be open?",
            "rating": 0.7506,
            "company_keywords": [
                "news"
            ]
        }
    ]
}