{
    "last_updated": 1673755489,
    "tweets": [
        {
            "created_at": 1673359352,
            "text": "Good morning. We're issuing a unique new report and \"Strong Sell\" opinion on Super Micro Computer (Nasdaq: $SMCI) with 40-50% downside risk. Be warned, they settled SEC charges in 2020 for \"widespread\" accounting violations https://t.co/IXjgLYm5Jo",
            "rating": 0.1027,
            "company_keywords": [
                "nasdaq"
            ]
        },
        {
            "created_at": 1672454558,
            "text": "If you invested in the market the past two years, chances are you lost money. If you didn't invest in the market, you also lost because of inflation. Either way you probably lost.   Great outcome compliments of our leadership",
            "rating": 0.4019,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1672330112,
            "text": "Time to reflect on lessons learned or reinforced in 2022. The #FederalReserve is not your friend neither are any stock promoters that almost never say sell. Ultimate lessons: believe in yourself and due you own due diligence. IN SPRUCE POINT WE TRUST.",
            "rating": 0.341,
            "company_keywords": [
                "trust"
            ]
        },
        {
            "created_at": 1672325443,
            "text": "I stand corrected. There is a lower form of company and it's called Skechers $SKX, two days left in the year and a bottom tier stock promoter initiates it with a \"Neutral\" rating. That's wall street indirect speak for no compelling reason to own https://t.co/U46qGvekal",
            "rating": -0.3612,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1671571056,
            "text": "$NKE Nike #sneakers disappoint in #China $1.79 vs $1.81bn expected. Revenues down 3%. Look out below for no moat $SKX #Skechers with outsized exposure to China #bearish",
            "rating": -0.5994,
            "company_keywords": [
                "nike"
            ]
        },
        {
            "created_at": 1671549671,
            "text": "Keeping tabs on #milk USDA reported -3.1% MoM production decline in Nov; YoY inc has been falling steadily since August to just +1.4%. Fonterra (world's biggest exporter) + Synlait, two producers just cut prices citing weak demand. Fonterra index just fell 3.8%. Bearish $SAP.TO https://t.co/zzCAILRwju",
            "rating": -0.7269,
            "company_keywords": [
                "nov",
                "two"
            ]
        },
        {
            "created_at": 1669913785,
            "text": "Our letter addressed to the new Audit Chair of $SAP.TO, #Saputo - to cut to the chase, prove us wrong and engage an independent forensic review board to evaluate our claims https://t.co/b3U5jZc86T",
            "rating": -0.4215,
            "company_keywords": [
                "chase"
            ]
        },
        {
            "created_at": 1669813358,
            "text": "In our view, more signs of struggles emerging at Broadridge $BR, announcing a CEO transition already at its promoted LTX unit. Historically a business process outsourcing company, does it really stand a chance in \"AI trading\" ... #skeptic https://t.co/M3hk0ikNYZ",
            "rating": 0.3214,
            "company_keywords": [
                "unit",
                "view"
            ]
        },
        {
            "created_at": 1669758397,
            "text": "Catch Spruce Point Founder and CIO Ben Axler live tomorrow Nov 30th on @BNNBloomberg @business Wednesday at 9:40am EST live. No holds barred.",
            "rating": -0.296,
            "company_keywords": [
                "nov"
            ]
        },
        {
            "created_at": 1669752977,
            "text": "$SAP.TO International segment is #Australia and #Argetnina. Now with the benefit of being able to see reported Aussie EBITDA, we can get a good picture of what Argentina looks like. Margins crashed from an astronomical level, but management's MD&amp;A says nothing at all #shady https://t.co/VjCWJ2Mx9D",
            "rating": 0.5719,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1669747454,
            "text": "The two minute quick pitch on #Saputo $SAP.TO and why a struggling dairy and cheese roll-up is a compelling short idea https://t.co/elx7gDi3NO",
            "rating": -0.2263,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1669746662,
            "text": "Huge red flag that $SAP.TO does not give an accurate/complete view of its org structure. Notice it obscures that Australia is held in a numbered entity. When we found this and examined the #Australia regulatory financials, a total disaster emerged. https://t.co/JbVr1K7wDJ",
            "rating": -0.4215,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1669742750,
            "text": "Sneaky - $SAP.TO updated its website and claims about Vitalite, its \"leading\" or rather \"market share losing\" plant-based spread business. The acquisition they made in the UK of Dairy Crest (pre-Brexit) is a total disaster in our view https://t.co/eNGN5IGalm",
            "rating": -0.7506,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1669737599,
            "text": "We always try to conduct interviews of fmr employees. In the case of $SAP.TO + its US struggles, we learned it lost business form Little Caesars #pizza #pizza.  How are they going to replace this? According to our expert, they don't offer a special frozen style pizza cheese https://t.co/PKKxuhP2t0",
            "rating": -0.7234,
            "company_keywords": [
                "fmr"
            ]
        },
        {
            "created_at": 1669669574,
            "text": "Tired already of reading about the #FTXbankruptcy scandal? Want to nibble on something new? Tomorrow Nov 29th, we'll release a unique forensic investigative report on a company that has faced past allegations of connections to mobsters and criminals https://t.co/xHkyI0XkOk https://t.co/Wnp5Y5YBIp",
            "rating": -0.8611,
            "company_keywords": [
                "nov"
            ]
        },
        {
            "created_at": 1667581807,
            "text": "The stock scheme known as $MGPI continues to restate Luxco disclosures and sales results. Margins fell in two of three segments this qtr, excluding the Luxco segment, which it has clear reporting issues. You can't convince us that its financial statements aren't misstated.",
            "rating": 0.2168,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1667400246,
            "text": "When it rains it pours, Broadridge (NYSE: BR) losing $30m of recurring revenue from new SEC rule change. Lower your DCF and target price. Even stacking the Board with a former SEC Commissioner couldn't save them... #negative #bearish. https://t.co/wUDahHWTPo",
            "rating": -0.7527,
            "company_keywords": [
                "target"
            ]
        }
    ]
}