{
    "last_updated": 1673755496,
    "tweets": [
        {
            "created_at": 1658794451,
            "text": "Amazon should issue a token for 5% back on all purchases online or at Whole Foods. Now that would be disruptive. Maybe partner with visa to enable. https://t.co/tXqv5PrR3t",
            "rating": -0.1531,
            "company_keywords": [
                "visa",
                "now"
            ]
        },
        {
            "created_at": 1645100112,
            "text": "RT @InvestorOpera: Opera Reports Fourth Quarter Results\nBoth revenue and adjusted EBITDA exceeded expectations\nIssues 2022 guidance for rev…",
            "rating": 0.0,
            "company_keywords": [
                "opera"
            ]
        },
        {
            "created_at": 1628766583,
            "text": "RT @InvestorOpera: Opera Limited announces second quarter 2021 financial results, revenue growth exceeds expectations and adjusted EBITDA m…",
            "rating": 0.1779,
            "company_keywords": [
                "opera"
            ]
        },
        {
            "created_at": 1627044982,
            "text": "Some personal news - after many years on the buyside (more good than bad) I have left that behind to head up investor relations at $OPRA. This will remain my personal account and of course follow @InvestorOpera for official news.",
            "rating": 0.4404,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1570136205,
            "text": "Apple buying soundjam in 2000, this was the predecessor to iTunes which changed the entire trajectory of Apple and the entire tech industry. iTunes&gt;iPod&gt;iPhone&gt;all touch enabled smartphones/tablets https://t.co/nGyOpa24bL",
            "rating": 0.0,
            "company_keywords": [
                "apple"
            ]
        },
        {
            "created_at": 1554122929,
            "text": "I figure there must be a lot of overlap between fintwit and #watch Twitter. My FIL gave my son his old watch but he is still too young to wear it. Do I need a watch winder to keep it in good working order?",
            "rating": 0.5927,
            "company_keywords": [
                "fil"
            ]
        },
        {
            "created_at": 1529592238,
            "text": "He can’t accept that he is an elite that other elites from his hometown don’t like. Just like fox is MSM by definition of having the highest ratings. If most people get news from you it’s mainstream. https://t.co/KPRZCE5kbj",
            "rating": 0.765,
            "company_keywords": [
                "news"
            ]
        },
        {
            "created_at": 1528116079,
            "text": "Just because @Spotify doesn’t want to be in a position to police artists like @rkelly , @chrisbrown @TedNugent  and others doesn’t mean I shouldn’t have the ability to block their songs.",
            "rating": 0.296,
            "company_keywords": [
                "block"
            ]
        },
        {
            "created_at": 1515120097,
            "text": "RT @Kasparov63: Over 1500 registrants for the Greater NY Scholastic Team and Individual Chess Championships this weekend in Brooklyn! The K…",
            "rating": 0.7177,
            "company_keywords": [
                "scholastic"
            ]
        },
        {
            "created_at": 1514826776,
            "text": "I think the cardboard pizza box would taste better than this pizza #shady",
            "rating": 0.4404,
            "company_keywords": [
                "box"
            ]
        }
    ]
}