{
    "last_updated": 1673755497,
    "tweets": [
        {
            "created_at": 1673575117,
            "text": "“Phones” are being “improved” seemingly constantly, but the computers at the FAA are contemporaries maybe of the Walkman.\n\nWith tens of trillions of National Debt and $50+ Billion having been wired to airline companies less than two years ago…\n\nWhat’s Going On?",
            "rating": -0.5023,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1673233648,
            "text": "Nyheim Hines’ two kickoff TD run backs today is only the 11th (eleven is a DoubleLine) such occurrence in NFL history.\n\nGiven the rules today, versus years ago, this accomplishment is even more absurdly improbable.\n\nGo Bills.",
            "rating": -0.0516,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1669615234,
            "text": "As the Fed keeps talking tough (though less united lately):\n\nUST 10 Year yield now 79 bp less than UST 2 Year yield.\n\nUST 10 Year yield down 60 bp from recent high.\n\nUST 2 Year yield down 30 bp from recent high.\n\nAs the Fed keeps talking tough.",
            "rating": 0.1298,
            "company_keywords": [
                "bp"
            ]
        },
        {
            "created_at": 1664410461,
            "text": "Even after today’s rally in everything, here is “the bloodless verdict of the market” since Fed days close last week: 10 yr UST yield +23 bp, SPX -4%, JNK -2%, BCOM -4%, LQD -3%, BKLN -2%, EEM -5%, EMB -4%.",
            "rating": 0.1531,
            "company_keywords": [
                "bp"
            ]
        },
        {
            "created_at": 1664324106,
            "text": "The Nasdaq Total Return YTD is -30.36% and The Long Maturity UST ETF is -30.94%.  “Risk parity” is clearly not working out so far this year.",
            "rating": 0.4019,
            "company_keywords": [
                "nasdaq"
            ]
        },
        {
            "created_at": 1664236857,
            "text": "The National Average 30 year mortgage rate is sprinting toward 7%.    Thanks to 40% median home price increases over the past two years and the massive increase in mortgage interest rates the monthly payment on the median priced US home is already up about 100% vs. two years ago.",
            "rating": 0.802,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1664064230,
            "text": "The DJIA, DJTA, SPX and NASDAQ indices have all broken down below the important trend lines connecting the lows of March 2020 and June 2022.\n\nThe Dow Jones Utility Index has not, even as Treasury yields have exploded higher.\n\nA harbinger, perhaps?",
            "rating": -0.5707,
            "company_keywords": [
                "nasdaq"
            ]
        },
        {
            "created_at": 1663718406,
            "text": "The Buffalo Bills’ 2022 season schedule  began with the following two opponents:  (1) The defending Super Bowl Champions (in the opponent’s house) and (2) The AFC’s number one 2021 playoff seed.  Cumulative score:  Bills 72, them 17.",
            "rating": 0.8225,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1661916023,
            "text": "In the UST Market:  2 year/ 10 year inverted 35 bp.  5 year/ 30 year inverted once again, five basis points right now.  These are reliable signals of economic trouble.  Risk manage accordingly.",
            "rating": -0.5859,
            "company_keywords": [
                "bp"
            ]
        },
        {
            "created_at": 1661375069,
            "text": "The debt jubilee enters phase two.",
            "rating": -0.3612,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1658288295,
            "text": "The US Treasury yield curve two years on out is flat as a pancake at about 3.2%.  Seems low in a world of 10% year-on-year past inflation, right?  Not necessarily.",
            "rating": -0.0772,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1657073998,
            "text": "The 30 year UST action today is the mirror image of the throwover mid June which presaged a 75 bp drop in yields.  Mirror image.",
            "rating": -0.2732,
            "company_keywords": [
                "bp"
            ]
        },
        {
            "created_at": 1655422538,
            "text": "30-year yield took out the 2018 closing high today only to powerfully reverse by 25 bp.  This action is called a “throw over” and often marks an important trend reversal.",
            "rating": 0.2023,
            "company_keywords": [
                "bp"
            ]
        },
        {
            "created_at": 1655092546,
            "text": "US Treasury curve is now pricing in ten Fed rate hikes of 25 bp by year end. There are five Fed meetings before year end (starting with this week). The bloodless verdict of the market is a 50 bp hike every meeting unless JP puts bigger individual hikes “on the table” before that.",
            "rating": 0.6037,
            "company_keywords": [
                "bp"
            ]
        },
        {
            "created_at": 1653068102,
            "text": "Less than two months ago Biden said his sanctions against Russia would “reduce the Ruble to rubble”.  \n\nToday the Ruble is at its strongest versus the Euro since 2016.\n\nToday the Ruble is at its strongest versus the Dollar since 2018.",
            "rating": 0.7003,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1652913267,
            "text": "SPX gapped up on the open May 13 and again May 17.\n\nOnly to gap down on the open today &amp; closing below the close May 12.  This action comprises a very rare “double island top” and advises caution still, as does VIX being not sufficiently elevated in the double island top context.",
            "rating": 0.2023,
            "company_keywords": [
                "gap"
            ]
        }
    ]
}