{
    "last_updated": 1673755495,
    "tweets": [
        {
            "created_at": 1673284434,
            "text": "We immediately block the account and raise a flag to FB. But yeah I'm curious what percentage of people fall for this. \n\nI'm willing to bet about 1% fall for it - and then I guess you pick up free stuff? Is that lucrative enough? \n\nLEARNING: Always check the email sender!\n\n4/4",
            "rating": 0.8721,
            "company_keywords": [
                "block"
            ]
        },
        {
            "created_at": 1669858222,
            "text": "The big lie: Telling yourself you don't have time to do something important. You have time: it's what you prioritize that matters.\n\nNow - I know we all have stuff going on, but ruthless prioritization and focus is what will get you to where you wanna be.",
            "rating": 0.1154,
            "company_keywords": [
                "now"
            ]
        },
        {
            "created_at": 1667964082,
            "text": "Say it with me: Financial Regulations like Dodd-Frank are important! \n\n#Crypto",
            "rating": 0.5562,
            "company_keywords": [
                "crypto"
            ]
        },
        {
            "created_at": 1667493974,
            "text": "The #Airbnb apocalypse is beginning.\n\n\"...market analysts say many U.S. Airbnbs are sitting empty because so many wealthier people and investors listed short-term rentals on the site, in the wake of a pandemic-fueled boom.\"\n\nhttps://t.co/rlOjeslfy9",
            "rating": 0.3976,
            "company_keywords": [
                "airbnb"
            ]
        },
        {
            "created_at": 1667446398,
            "text": "Trend 8: Infrastructure spending, baby\n\nFederal investment into decaying infrastructure ($1 trillion Bipartisan Infrastructure Law signed in Nov 2021) will focus on transportation spending along with other areas like broadband internet access.",
            "rating": -0.0516,
            "company_keywords": [
                "nov"
            ]
        },
        {
            "created_at": 1667446392,
            "text": "Trend 4: A Tale of Two Much/Too Many\nAffordability is low and undersupply of building is high. \n\nLabor shortages, materials, supply chain, oh my! And restrictive zoning/building codes, NIMBYism, and fear for the future are limiting building.",
            "rating": -0.7345,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1667338921,
            "text": "\"No one will just give you trust, success, and admiration. You must earn it.\" @farnamstreet",
            "rating": 0.8519,
            "company_keywords": [
                "trust"
            ]
        },
        {
            "created_at": 1666028307,
            "text": "2) Opportunity - this is an industry that won't get automated. You always will need appraisers even in a recession: Government work, taxes, death, financing, etc. You need appraisers to provide an objective view of value in the real estate chain.",
            "rating": -0.3612,
            "company_keywords": [
                "view"
            ]
        },
        {
            "created_at": 1664815671,
            "text": "RT @drgurner: Today is a great day to absolutely destroy the box that others have tried to put you in.",
            "rating": 0.079,
            "company_keywords": [
                "box"
            ]
        },
        {
            "created_at": 1663710254,
            "text": "Netflix's \"Buy My House\" feels like the perfect example of why Redfin is in trouble: Overpaying for homes sight unseen. Glenn Kelman and team's decision to appear on this in 2021 is a Shakespearian level of ineptitude. https://t.co/b7QaJpaxJb",
            "rating": 0.5423,
            "company_keywords": [
                "redfin",
                "netflix"
            ]
        }
    ]
}