{
    "last_updated": 1673755494,
    "tweets": [
        {
            "created_at": 1673740818,
            "text": "Brandon Staley and Doug Pederson's teams face off in tonight's wild card game. They're two of the seven NFL head coaches in the playoffs who have something in common—they worked for Andy Reid or Sean McVay. https://t.co/9fuJaSzvvw",
            "rating": 0.0,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1673740325,
            "text": "Two waves of Russian missiles rocked Ukraine, killing at least 12 in Dnipro. Meanwhile, the U.K. became the first country to agree to send Western battle tanks to Ukraine. https://t.co/h8R4vnxmlO",
            "rating": -0.6705,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1673739903,
            "text": "China’s zero-Covid policies caused political unrest, but the rapid shift away from them is causing its own problems  https://t.co/hWlNpuSwBA",
            "rating": -0.5499,
            "company_keywords": [
                "shift"
            ]
        },
        {
            "created_at": 1673721006,
            "text": "Reported sightings of UFOs have climbed significantly in the past two years, and almost half the new sightings remain unexplained, U.S. spy agencies and the Pentagon said in a report https://t.co/vdnV98sCiw",
            "rating": 0.0,
            "company_keywords": [
                "two"
            ]
        },
        {
            "created_at": 1673703012,
            "text": "Netflix is ending password sharing, after thinking through hard questions such as: Who should be considered part of a \"household\"? It's a risk for a company that once tweeted \"Love is sharing a password.\" https://t.co/YkGDXzLpks",
            "rating": 0.8074,
            "company_keywords": [
                "netflix"
            ]
        },
        {
            "created_at": 1673700261,
            "text": "Worker pay increases fell behind inflation in 2022 for the second year in a row, leaving households worse off despite historically strong wage gains. But recent data suggest a shift is under way. https://t.co/Q2cgBxUpzU",
            "rating": -0.3402,
            "company_keywords": [
                "shift"
            ]
        },
        {
            "created_at": 1673698511,
            "text": "\"We kind of lost track of our families, our passions, our hobbies.\" Former employees of SpaceX and Tesla on what it’s like working for Elon Musk. https://t.co/Cx3tPaTUxj",
            "rating": 0.4779,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673681411,
            "text": "Business is deteriorating rapidly at used-car seller Carvana, which is cutting hours for its staff and big rounds of layoffs. The slowdown will make it harder for the company to keep servicing its heavy debt load. https://t.co/mJKFAkOEs7",
            "rating": -0.4588,
            "company_keywords": [
                "carvana"
            ]
        },
        {
            "created_at": 1673675110,
            "text": "Tesla cut prices for some of its vehicles sold in the U.S. by nearly 20%, aiming to lure new buyers https://t.co/nnyK3VpYa6",
            "rating": -0.2732,
            "company_keywords": [
                "tesla"
            ]
        },
        {
            "created_at": 1673664304,
            "text": "Review: In Netflix’s \"Break Point,\" tennis’s new generation, represented here by such players as Nick Kyrgios and Matteo Berrettini, receives a closer look https://t.co/9GGd3o1YBI",
            "rating": 0.0,
            "company_keywords": [
                "netflix"
            ]
        }
    ]
}